docs/Primjeri_poruka_eIzvjestavanja/Neuspjesan_Odgovor_EvidentirajNaplatu.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:eiz="http://www.porezna-uprava.gov.hr/fin/2024/types/eizjestavanje" xmlns:fis="http://www.porezna-uprava.gov.hr/fin/2024/types/eFiskalizacija">
	<soapenv:Body>
		<eiz:EvidentirajNaplatuOdgovor eiz:id="1e9e7b3c-b2e9-4a0e-9b50-2a0cfcc0551d">
			<eiz:datumVrijemeSlanja>2025-06-20T09:26:40+02:00</eiz:datumVrijemeSlanja>
			<eiz:Odgovor>
				<eiz:idZahtjeva>22bc1e3e-feb4-47d5-95cd-2a0cfcc0bd71</eiz:idZahtjeva>
				<eiz:prihvacenZahtjev>false</eiz:prihvacenZahtjev>
				<eiz:greska>
					<eiz:sifra>S009</eiz:sifra>
					<eiz:redniBrojZapisa>1</eiz:redniBrojZapisa>
					<eiz:opis>Ne postoji evidentirana fiskalizacija eRačuna.</eiz:opis>
				</eiz:greska>
			</eiz:Odgovor>
			<Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
				<SignedInfo>
					<CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
					<SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
					<Reference URI="#1e9e7b3c-b2e9-4a0e-9b50-2a0cfcc0551d">
						<Transforms>
							<Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
							<Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
						</Transforms>
						<DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/>
						<DigestValue>8zDDSOS...</DigestValue>
					</Reference>
				</SignedInfo>
				<SignatureValue>ScXlDSsH7T7...</SignatureValue>
				<KeyInfo>
					<X509Data>
						<X509Certificate>[BASE64 certifikatg</X509Certificate>
						<X509IssuerSerial>
							<X509IssuerName>...</X509IssuerName>
							<X509SerialNumber>...</X509SerialNumber>
						</X509IssuerSerial>
					</X509Data>
				</KeyInfo>
			</Signature>
		</eiz:EvidentirajNaplatuOdgovor>
	</soapenv:Body>
</soapenv:Envelope>